In [2]:
# Q1-
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})
df.iloc[0]

course_name    Data Science
duration                  2
Name: 0, dtype: object

Q2-
loc is uded for accessing rows and columns  labeled dataset 

iloc is sed for accessing  rows and columns  indexed datset

In [3]:
# Q3-
reindex = [3,0,1,2]
new_df=pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration,'2':reindex})

new_df

        course_name  duration  2
0      Data Science         2  3
1  Machine Learning         3  0
2          Big Data         6  1
3     Data Engineer         4  2

In [4]:
new_df.iloc[2]

course_name    Big Data
duration              6
2                     1
Name: 2, dtype: object

In [5]:
new_df.loc[2]

course_name    Big Data
duration              6
2                     1
Name: 2, dtype: object

explation-
Yes, there is a difference in the outputs of new_df.loc[2] and new_df.iloc[2].

new_df.loc: Since the index of new_df is now [3, 0, 1, 2], new_df.loc[] will print the row at the label 2 in the index.

new_df.iloc: new_df.iloc[2] returns the row that has the integer position 2 in the index.

In [6]:
# Q4
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.741642  0.677568  0.314796  0.707306  0.990611  0.000834
2  0.905181  0.290835  0.082255  0.293528  0.157673  0.061520
3  0.995873  0.315296  0.650152  0.792280  0.605597  0.246738
4  0.034286  0.476003  0.722083  0.940688  0.880217  0.872640
5  0.295023  0.955429  0.781055  0.166603  0.016045  0.046439
6  0.540460  0.540368  0.722356  0.742005  0.793786  0.452258

In [7]:
# i)
df1.mean()

column_1    0.585411
column_2    0.542583
column_3    0.545449
column_4    0.607069
column_5    0.573988
column_6    0.280072
dtype: float64

In [8]:
# ii)
df1['column_2'].std()

0.24824878624793614

In [9]:
# Q5-

Q6-
Pandas window functions are functions where the input values are taken from a “window” of one or more rows in a series or a table and calculation is performed over them.
Rolling functions: These functions compute a rolling statistic over a defined window size. Examples include rolling mean, rolling sum, rolling standard deviation, etc.

Expanding functions: These functions compute a cumulative statistic over the entire dataset up to the current point. Examples include expanding sum, expanding mean, etc.

Exponentially weighted functions: These functions compute a rolling statistic with weights that decay exponentially as the distance from the current point increases. Examples include exponentially weighted mean, exponentially weighted standard deviation, etc.

Cumulative functions: These functions compute a cumulative statistic over the entire dataset up to the current point. Examples include cumsum, cummax, cummin, etc.

Aggregating functions: These functions perform a groupby-style operation on a rolling or expanding window. Examples include groupby.mean(), groupby.sum(), etc.

In [10]:
# Q7-
data_dict = {
    'current_date':['2023-02-26']
}

df = pd.DataFrame(data_dict)
df
df['current_date']=pd.to_datetime(df['current_date'])
df['current_date'].dt.month
df['current_date'].dt.year

0    2023
Name: current_date, dtype: int32

In [ ]:
# Q8-
start_date = input("Enter first date: ")
end_date = input("Enter second date: ")

days_in_between = pd.date_range(start = start_date, end = end_date)
difference = len(days_in_between)

print(f'The difference between the first date and second date is {difference} days')

#First date entered: 2022-01-01
#Second date entered: 2022-02-01

In [11]:
# Q9-
filepath = input('Enter the filepath: ')
column = input('Enter the column name: ')
order = input('Enter category order: ')

df = pd.read_csv(filepath)

df[column].astype('category')

if order=='ascending':
    df=df.sort_values(by = column, ascending= True)
elif order=='descending':
    df=df.sort_values(by = column, ascending= False)

df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# Q10-
filepath = input('Enter filepath: ')

df = pd.read_csv(filepath)
df['Date'] = pd.to_datetime(df['Date'])
grouped = df.groupby(['Product', 'Date']).sum()
pivot = grouped.unstack(level=0)
pivot.plot(kind='bar', stacked=True)

In [ ]:
# Q11-
filepath = input('Enter Filepath: ')

df = pd.read_csv(filepath)

mean = df['Test_Score'].mean()
median = df['Test_Score'].median()
mode = df['Test_Score'].mode()

print("+----------+----------+")
print("Statistic | Value")
print(f"Mean:    {mean}")
print(f"Median:    {median}")
print(f"Mode:    {mode}")
print("+----------+----------+")